tutorials/incompressible/simpleFoam/threeFingersFourRadii/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel powerLaw;

powerLawCoeffs
{
    nuMax    [ 0 2 -1 0 0 0 0 ] 1e12;
    nuMin    [ 0 2 -1 0 0 0 0 ] 1e-12;
    k        [ 0 2 -1 0 0 0 0 ] 10;
    n        [ 0 0  0 0 0 0 0 ] 0.5;
}

rho	rho [1 -3 0 0 0 0 0] 1100;

// ************************************************************************* //